Repository: MusilyApp/musily_installer
Catalog: lib/l10n/app_*.arb
Languages: es, pt, ru, uk

# appTitle
source: Musily Installer
es: Instalador de Musily
pt: Instalador do Musily
ru: Установщик Musily
uk: Встановлювач Musily

# updateTitle
source: Update Musily
es: Actualizar Musily
pt: Atualizar Musily
ru: Обновить Musily
uk: Оновити Musily

# installTitle
source: Install Musily
es: Instalar Musily
pt: Instalar Musily
ru: Установить Musily
uk: Встановити Musily

# uninstallTitle
source: Uninstall Musily
es: Desinstalar Musily
pt: Desinstalar Musily
ru: Удалить Musily
uk: Видалити Musily

# warningUninstall
source: Warning: Uninstall Musily
es: Advertencia: Desinstalar Musily
pt: Aviso: Desinstalar Musily
ru: Внимание: Удаление Musily
uk: Увага: Видалення Musily

# warningUninstallMessage
source: This will remove Musily from your system. Your music library and preferences will be deleted.
es: Esto eliminará Musily de su sistema. Su biblioteca de música y preferencias serán eliminadas.
pt: Isto removerá o Musily do seu sistema. A sua biblioteca de música e preferências serão eliminadas.
ru: Это удалит Musily из вашей системы. Ваша музыкальная библиотека и настройки будут удалены.
uk: Це видалить Musily з вашої системи. Вашу музичну бібліотеку та налаштування буде видалено.

# uninstallConfirmation
source: I understand that this action cannot be undone
es: Entiendo que esta acción no se puede deshacer
pt: Eu entendo que esta ação não pode ser desfeita
ru: Я понимаю, что это действие нельзя отменить
uk: Я розумію, що цю дію не можна скасувати

# removeAppData
source: Remove all app data
es: Eliminar todos los datos de la aplicación
pt: Remover todos os dados da aplicação
ru: Удалить все данные приложения
uk: Видалити всі дані програми

# uninstallButton
source: Uninstall Musily
es: Desinstalar Musily
pt: Desinstalar Musily
ru: Удалить Musily
uk: Видалити Musily

source: Update Available
es: Actualización Disponible
pt: Atualização Disponível
ru: Доступно Обновление
uk: Доступне Оновлення

# currentVersion
source: Current version: {version}
es: Versión actual: {version}
pt: Versão atual: {version}
ru: Текущая версия: {version}
uk: Поточна версія: {version}

source: Installation Progress
es: Progreso de Instalación
pt: Progresso da Instalação
ru: Прогресс Установки
uk: Прогрес Встановлення

source: Uninstallation Progress
es: Progreso de Desinstalación
pt: Progresso da Desinstalação
ru: Прогресс Удаления
uk: Прогрес Видалення

source: Update Progress
es: Progreso de Actualización
pt: Progresso da Atualização
ru: Прогресс Обновления
uk: Прогрес Оновлення

source: Show terminal output
es: Mostrar salida del terminal
pt: Mostrar saída do terminal
ru: Показать вывод терминала
uk: Показати вивід терміналу

source: Installation Complete
es: Instalación Completada
pt: Instalação Concluída
ru: Установка Завершена
uk: Встановлення Завершено

source: Uninstallation Complete
es: Desinstalación Completada
pt: Desinstalação Concluída
ru: Удаление Завершено
uk: Видалення Завершено

source: Update Complete
es: Actualización Completada
pt: Atualização Concluída
ru: Обновление Завершено
uk: Оновлення Завершено

# installationCompleteMessage
source: Musily has been successfully installed on your system.
es: Musily se ha instalado correctamente en su sistema.
pt: O Musily foi instalado com sucesso no seu sistema.
ru: Musily успешно установлен в вашей системе.
uk: Musily успішно встановлено у вашій системі.

# uninstallationCompleteMessage
source: Musily has been successfully removed from your system.
es: Musily se ha eliminado correctamente de su sistema.
pt: O Musily foi removido com sucesso do seu sistema.
ru: Musily успешно удален из вашей системы.
uk: Musily успішно видалено з вашої системи.

# updateCompleteMessage
source: Musily has been successfully updated.
es: Musily se ha actualizado correctamente.
pt: O Musily foi atualizado com sucesso.
ru: Musily успешно обновлен.
uk: Musily успішно оновлено.

# runAfterInstall
source: Run Musily after installation
es: Ejecutar Musily después de la instalación
pt: Executar o Musily após a instalação
ru: Запустить Musily после установки
uk: Запустити Musily після встановлення

source: Finish
es: Finalizar
pt: Terminar
ru: Завершить
uk: Завершити

source: Next
es: Siguiente
pt: Seguinte
ru: Далее
uk: Далі

source: Back
es: Atrás
pt: Voltar
ru: Назад
uk: Назад

source: Cancel
es: Cancelar
pt: Cancelar
ru: Отмена
uk: Скасувати

# error
source: Error: {message}
pt: Erro: {message}
ru: Ошибка: {message}
uk: Помилка: {message}

source: Change language
es: Cambiar idioma
pt: Alterar idioma
ru: Изменить язык
uk: Змінити мову

# checkingMusily
source: Checking if Musily is running...
es: Comprobando si Musily está en ejecución...
pt: A verificar se o Musily está em execução...
ru: Проверка, запущен ли Musily...
uk: Перевірка, чи запущено Musily...

# foundRunningMusily
source: Found running Musily process (PID: {pid}), terminating...
es: Se encontró un proceso de Musily en ejecución (PID: {pid}), terminando...
pt: Encontrado processo do Musily em execução (PID: {pid}), a terminar...
ru: Найден запущенный процесс Musily (PID: {pid}), завершение...
uk: Знайдено запущений процес Musily (PID: {pid}), завершення...

# musilyTerminated
source: Musily process terminated successfully
es: Proceso de Musily terminado con éxito
pt: Processo do Musily terminado com sucesso
ru: Процесс Musily успешно завершен
uk: Процес Musily успішно завершено

# removingAppFiles
source: Removing application files...
es: Eliminando archivos de la aplicación...
pt: A remover ficheiros da aplicação...
ru: Удаление файлов приложения...
uk: Видалення файлів програми...

# removingAppData
source: Removing application data...
es: Eliminando datos de la aplicación...
pt: A remover dados da aplicação...
ru: Удаление данных приложения...
uk: Видалення даних програми...

# appDataRemoved
source: Application data removed successfully
es: Datos de la aplicación eliminados con éxito
pt: Dados da aplicação removidos com sucesso
ru: Данные приложения успешно удалены
uk: Дані програми успішно видалено

# failedRemoveData
source: Failed to remove application data: {error}
es: Error al eliminar los datos de la aplicación: {error}
pt: Falha ao remover os dados da aplicação: {error}
ru: Не удалось удалить данные приложения: {error}
uk: Не вдалося видалити дані програми: {error}

# updatingDesktopDb
source: Updating desktop database...
es: Actualizando base de datos de escritorio...
pt: A atualizar a base de dados do ambiente de trabalho...
ru: Обновление базы данных рабочего стола...
uk: Оновлення бази даних робочого столу...

# failedUpdateDb
source: Failed to update desktop database
es: Error al actualizar la base de datos de escritorio
pt: Falha ao atualizar a base de dados do ambiente de trabalho
ru: Не удалось обновить базу данных рабочего стола
uk: Не вдалося оновити базу даних робочого столу

# unableToTerminate
source: Unable to terminate Musily. Please close it manually.
es: No se puede terminar Musily. Por favor, ciérrelo manualmente.
pt: Não foi possível terminar o Musily. Por favor, feche-o manualmente.
ru: Не удается завершить Musily. Пожалуйста, закройте его вручную.
uk: Не вдається завершити Musily. Будь ласка, закрийте його вручну.

# installingDependencies
source: Installing missing dependencies...
es: Instalando dependencias faltantes...
pt: A instalar dependências em falta...
ru: Установка недостающих зависимостей...
uk: Встановлення відсутніх залежностей...

# dependenciesInstalled
source: Dependencies installed successfully.
es: Dependencias instaladas correctamente.
pt: Dependências instaladas com sucesso.
ru: Зависимости успешно установлены.
uk: Залежності успішно встановлено.

# failedInstallDeps
source: Failed to install dependencies
es: Error al instalar las dependencias
pt: Falha ao instalar dependências
ru: Не удалось установить зависимости
uk: Не вдалося встановити залежності

# backingUpConfig
source: Backing up configuration...
es: Respaldando configuración...
pt: A fazer cópia de segurança da configuração...
ru: Резервное копирование конфигурации...
uk: Резервне копіювання конфігурації...

# restoringConfig
source: Restoring configuration...
es: Restaurando configuración...
pt: A restaurar configuração...
ru: Восстановление конфигурации...
uk: Відновлення конфігурації...

# installingIcon
source: Installing application icon...
es: Instalando icono de la aplicación...
pt: A instalar ícone da aplicação...
ru: Установка значка приложения...
uk: Встановлення значка програми...

source: Creating desktop entry...
es: Creando entrada de escritorio...
pt: A criar entrada no ambiente de trabalho...
ru: Создание ярлыка в меню приложений...
uk: Створення ярлика в меню програм...
